In [1]:
import requests
from bs4 import BeautifulSoup as BS
import pandas as pd
import numpy as np
import re
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
DavidsonDiversity = pd.read_csv('../CapstoneData/Population/Davidson/Davidson Diversity.csv')
DavidsonEducation = pd.read_csv('../CapstoneData/Population/Davidson/Davidson Education.csv')
DavidsonEmployment = pd.read_csv('../CapstoneData/Population/Davidson/Davidson Employment.csv')
DavidsonHousehold = pd.read_csv('../CapstoneData/Population/Davidson/Davidson Household.csv')
DavidsonIncome = pd.read_csv('../CapstoneData/Population/Davidson/Davidson Income.csv')
DavidsonOccupancy = pd.read_csv('../CapstoneData/Population/Davidson/Davidson Occupancy.csv')

### DavidsonDiversity

In [4]:
DavidsonDiversity = DavidsonDiversity.rename(columns={'Label (Grouping)':'Group','Davidson County, Tennessee':'Population'}).reset_index(drop=True)
DavidsonDiversity = DavidsonDiversity.drop([2, 3])
DavidsonDiversity = DavidsonDiversity.head(8).reset_index(drop = True)
DavidsonDiversity.to_csv('DavidsonDiversity.csv')

In [5]:
DavidsonEmployment = DavidsonEmployment.rename(columns= {'Label (Grouping)':'Groups','Davidson County, Tennessee!!Estimate':'Population'}).reset_index(drop=True)
DavidsonEmployment =  DavidsonEmployment[['Groups','Population']]
DavidsonEmployment

                                              Groups Population
0                                  EMPLOYMENT STATUS        NaN
1                       Population 16 years and over    581,955
2                                     In labor force    422,972
3                               Civilian labor force    422,520
4                                           Employed    409,433
..                                               ...        ...
140                                18 years and over        (X)
141                                   18 to 64 years        (X)
142                                65 years and over        (X)
143                               People in families        (X)
144          Unrelated individuals 15 years and over        (X)

[145 rows x 2 columns]

### DavidsonIncomeLevels

In [7]:
DavidsonIncomeLevels = DavidsonEmployment.loc[56:66].reset_index(drop=True)
DavidsonIncomeLevels.to_csv('DavidsonIncomeLevels.csv')

## DavidsonEmploymentGroups

In [9]:
DavidsonEmploymentGroups = DavidsonEmployment.drop([0]).head(7).reset_index(drop = True)
DavidsonEmploymentGroups.to_csv('DavidsonEmploymentGroups.csv')

### DavidsonEmploymentIndustries

In [11]:
DavidsonEmploymentIndustries = DavidsonEmployment.loc[35:48].reset_index(drop=True)
DavidsonEmploymentIndustries.to_csv('DavidsonEmploymentIndustries.csv')

In [12]:
DavidsonEducation= DavidsonEducation.rename(columns= {'Label (Grouping)':'Groups','Davidson County, Tennessee!!Total!!Estimate':'Total'})
DavidsonEducation= DavidsonEducation[['Groups','Total']]
DavidsonEducation

                                               Groups   Total
0                       AGE BY EDUCATIONAL ATTAINMENT     NaN
1                           Population 18 to 24 years  69,753
2                      Less than high school graduate   6,015
3           High school graduate (includes equival...  20,227
4                  Some college or associate's degree  24,618
..                                                ...     ...
63                     Less than high school graduate  35,936
64          High school graduate (includes equival...  39,076
65                 Some college or associate's degree  44,458
66                                  Bachelor's degree  66,741
67                    Graduate or professional degree  80,241

[68 rows x 2 columns]

### DavidsonEducationLevels

In [14]:
DavidsonEducationLevels = DavidsonEducation.loc[[1,3,5,6,9,15]].reset_index(drop=True)
DavidsonEducationLevels.to_csv('DavidsonEducationLevels.csv')

### DavidsonHouseholdAncestry

In [16]:
DavidsonHousehold= DavidsonHousehold.rename(columns={'Label (Grouping)':'Groups','Davidson County, Tennessee!!Estimate':'Total'})
DavidsonHousehold= DavidsonHousehold[['Groups','Total']]
DavidsonHouseholdAncestry = DavidsonHousehold.loc[140:167].reset_index(drop=True)
DavidsonHouseholdAncestry.to_csv('DavidsonHouseholdAncestry.csv')

# Fulton

In [18]:
FultonDiversity = pd.read_csv('../CapstoneData/Population/Fulton/Fulton Diversity.csv')
FultonEducation = pd.read_csv('../CapstoneData/Population/Fulton/Fulton Education.csv')
FultonEmployment = pd.read_csv('../CapstoneData/Population/Fulton/Fulton Employment.csv')
FultonHousehold = pd.read_csv('../CapstoneData/Population/Fulton/Fulton Household.csv')
FultonIncome = pd.read_csv('../CapstoneData/Population/Fulton/Fulton Income.csv')
FultonOccupancy = pd.read_csv('../CapstoneData/Population/Fulton/Fulton Occupancy.csv')

In [19]:
FultonDiversity = FultonDiversity.rename(columns={'Label (Grouping)':'Group','Fulton County, Georgia':'Population'}).reset_index(drop=True)
FultonDiversity = FultonDiversity.drop([2, 3])
FultonDiversity = FultonDiversity.head(8).reset_index(drop = True)
FultonDiversity.to_csv('FultonDiversity.csv')

In [20]:
FultonEmployment = FultonEmployment.rename(columns= {'Label (Grouping)':'Groups','Fulton County, Georgia!!Estimate':'Population'}).reset_index(drop=True)
FultonEmployment =  FultonEmployment[['Groups','Population']]
FultonEmployment

                                              Groups Population
0                                  EMPLOYMENT STATUS        NaN
1                       Population 16 years and over    884,526
2                                     In labor force    623,164
3                               Civilian labor force    622,533
4                                           Employed    594,912
..                                               ...        ...
140                                18 years and over        (X)
141                                   18 to 64 years        (X)
142                                65 years and over        (X)
143                               People in families        (X)
144          Unrelated individuals 15 years and over        (X)

[145 rows x 2 columns]

In [21]:
FultonIncomeLevels = FultonEmployment.loc[56:66].reset_index(drop=True)
FultonIncomeLevels.to_csv('FultonIncomeLevels.csv')

In [22]:
FultonEmploymentGroups = FultonEmployment.drop([0]).head(7).reset_index(drop = True)
FultonEmploymentGroups.to_csv('FultonEmploymentGroups.csv')

In [23]:
FultonEmploymentIndustries = FultonEmployment.loc[35:48].reset_index(drop=True)
FultonEmploymentIndustries.to_csv('FultonEmploymentIndustries.csv')

In [24]:
FultonEducation= FultonEducation.rename(columns= {'Label (Grouping)':'Groups','Fulton County, Georgia!!Total!!Estimate':'Total'})
FultonEducation= FultonEducation[['Groups','Total']]
FultonEducation

                                               Groups    Total
0                       AGE BY EDUCATIONAL ATTAINMENT      NaN
1                           Population 18 to 24 years  104,518
2                      Less than high school graduate    9,352
3           High school graduate (includes equival...   31,585
4                  Some college or associate's degree   40,077
..                                                ...      ...
63                     Less than high school graduate   27,386
64          High school graduate (includes equival...   38,566
65                 Some college or associate's degree   43,188
66                                  Bachelor's degree   79,541
67                    Graduate or professional degree  102,153

[68 rows x 2 columns]

In [25]:
FultonEducationLevels = FultonEducation.loc[[1,3,5,6,9,15]].reset_index(drop=True)
FultonEducationLevels.to_csv('FultonEducationLevels.csv')

In [26]:
FultonHousehold= FultonHousehold.rename(columns={'Label (Grouping)':'Groups','Fulton County, Georgia!!Estimate':'Total'})
FultonHousehold= FultonHousehold[['Groups','Total']]
FultonHouseholdAncestry = FultonHousehold.loc[140:167].reset_index(drop=True)
FultonHouseholdAncestry.to_csv('FultonHouseholdAncestry.csv')

# Shelby

In [28]:
ShelbyDiversity = pd.read_csv('../CapstoneData/Population/Shelby/Shelby Diversity.csv')
ShelbyEducation = pd.read_csv('../CapstoneData/Population/Shelby/Shelby Education.csv')
ShelbyEmployment = pd.read_csv('../CapstoneData/Population/Shelby/Shelby Employment.csv')
ShelbyHousehold = pd.read_csv('../CapstoneData/Population/Shelby/Shelby Household.csv')
ShelbyIncome = pd.read_csv('../CapstoneData/Population/Shelby/Shelby Income.csv')
ShelbyOccupancy = pd.read_csv('../CapstoneData/Population/Shelby/Shelby Occupancy.csv')

In [29]:
ShelbyDiversity = ShelbyDiversity.rename(columns={'Label (Grouping)':'Group','Shelby County, Tennessee':'Population'}).reset_index(drop=True)
ShelbyDiversity = ShelbyDiversity.drop([2, 3])
ShelbyDiversity = ShelbyDiversity.head(8).reset_index(drop = True)
ShelbyDiversity.to_csv('ShelbyDiversity.csv')

In [30]:
ShelbyEmployment = ShelbyEmployment.rename(columns= {'Label (Grouping)':'Groups','Shelby County, Tennessee!!Estimate':'Population'}).reset_index(drop=True)
ShelbyEmployment =  ShelbyEmployment[['Groups','Population']]
ShelbyEmployment

                                              Groups Population
0                                  EMPLOYMENT STATUS        NaN
1                       Population 16 years and over    704,636
2                                     In labor force    462,028
3                               Civilian labor force    461,137
4                                           Employed    431,238
..                                               ...        ...
140                                18 years and over        (X)
141                                   18 to 64 years        (X)
142                                65 years and over        (X)
143                               People in families        (X)
144          Unrelated individuals 15 years and over        (X)

[145 rows x 2 columns]

In [31]:
ShelbyIncomeLevels = ShelbyEmployment.loc[56:66].reset_index(drop=True)
ShelbyIncomeLevels.to_csv('ShelbyIncomeLevels.csv')

In [32]:
ShelbyEmploymentGroups = ShelbyEmployment.drop([0]).head(7).reset_index(drop = True)
ShelbyEmploymentGroups.to_csv('ShelbyEmploymentGroups.csv')

In [33]:
ShelbyEmploymentIndustries = ShelbyEmployment.loc[35:48].reset_index(drop=True)
ShelbyEmploymentIndustries.to_csv('ShelbyEmploymentIndustries.csv')

In [34]:
ShelbyEducation= ShelbyEducation.rename(columns= {'Label (Grouping)':'Groups','Shelby County, Tennessee!!Total!!Estimate':'Total'})
ShelbyEducation= ShelbyEducation[['Groups','Total']]
ShelbyEducation

                                               Groups   Total
0                       AGE BY EDUCATIONAL ATTAINMENT     NaN
1                           Population 18 to 24 years  78,505
2                      Less than high school graduate  10,699
3           High school graduate (includes equival...  30,143
4                  Some college or associate's degree  28,006
..                                                ...     ...
63                     Less than high school graduate  31,028
64          High school graduate (includes equival...  35,254
65                 Some college or associate's degree  41,524
66                                  Bachelor's degree  60,067
67                    Graduate or professional degree  73,334

[68 rows x 2 columns]

In [35]:
ShelbyEducationLevels = ShelbyEducation.loc[[1,3,5,6,9,15]].reset_index(drop=True)
ShelbyEducationLevels.to_csv('ShelbyEducationLevels.csv')

In [36]:
ShelbyHousehold= ShelbyHousehold.rename(columns={'Label (Grouping)':'Groups','Shelby County, Tennessee!!Estimate':'Total'})
ShelbyHousehold= ShelbyHousehold[['Groups','Total']]
ShelbyHouseholdAncestry = ShelbyHousehold.loc[140:167].reset_index(drop=True)
ShelbyHouseholdAncestry.to_csv('ShelbyHouseholdAncestry.csv')

# Knox

In [38]:
KnoxDiversity = pd.read_csv('../CapstoneData/Population/Knox/Knox Diversity.csv')
KnoxEducation = pd.read_csv('../CapstoneData/Population/Knox/Knox Education.csv')
KnoxEmployment = pd.read_csv('../CapstoneData/Population/Knox/Knox Employment.csv')
KnoxHousehold = pd.read_csv('../CapstoneData/Population/Knox/Knox Household.csv')
KnoxIncome = pd.read_csv('../CapstoneData/Population/Knox/Knox Income.csv')
KnoxOccupancy = pd.read_csv('../CapstoneData/Population/Knox/Knox Occupancy.csv')

In [39]:
KnoxDiversity = KnoxDiversity.rename(columns={'Label (Grouping)':'Group','Knox County, Tennessee':'Population'}).reset_index(drop=True)
KnoxDiversity = KnoxDiversity.drop([2, 3])
KnoxDiversity = KnoxDiversity.head(8).reset_index(drop = True)
KnoxDiversity.to_csv('KnoxDiversity.csv')

In [40]:
KnoxEmployment = KnoxEmployment.rename(columns= {'Label (Grouping)':'Groups','Knox County, Tennessee!!Estimate':'Population'}).reset_index(drop=True)
KnoxEmployment =  KnoxEmployment[['Groups','Population']]
KnoxEmployment

                                              Groups Population
0                                  EMPLOYMENT STATUS        NaN
1                       Population 16 years and over    407,877
2                                     In labor force    269,329
3                               Civilian labor force    268,390
4                                           Employed    259,025
..                                               ...        ...
140                                18 years and over        (X)
141                                   18 to 64 years        (X)
142                                65 years and over        (X)
143                               People in families        (X)
144          Unrelated individuals 15 years and over        (X)

[145 rows x 2 columns]

In [41]:
KnoxIncomeLevels = KnoxEmployment.loc[56:66].reset_index(drop=True)
KnoxIncomeLevels.to_csv('KnoxIncomeLevels.csv')

In [42]:
KnoxEmploymentGroups = KnoxEmployment.drop([0]).head(7).reset_index(drop = True)
KnoxEmploymentGroups.to_csv('KnoxEmploymentGroups.csv')

In [43]:
KnoxEmploymentIndustries = KnoxEmployment.loc[35:48].reset_index(drop=True)
KnoxEmploymentIndustries.to_csv('KnoxEmploymentIndustries.csv')

In [44]:
KnoxEducation= KnoxEducation.rename(columns= {'Label (Grouping)':'Groups','Knox County, Tennessee!!Total!!Estimate':'Total'})
KnoxEducation= KnoxEducation[['Groups','Total']]
KnoxEducation

                                               Groups   Total
0                       AGE BY EDUCATIONAL ATTAINMENT     NaN
1                           Population 18 to 24 years  59,938
2                      Less than high school graduate   3,828
3           High school graduate (includes equival...  16,874
4                  Some college or associate's degree  27,746
..                                                ...     ...
63                     Less than high school graduate  32,863
64          High school graduate (includes equival...  36,158
65                 Some college or associate's degree  40,291
66                                  Bachelor's degree  61,591
67                    Graduate or professional degree  71,749

[68 rows x 2 columns]

In [45]:
KnoxEducationLevels = KnoxEducation.loc[[1,3,5,6,9,15]].reset_index(drop=True)
KnoxEducationLevels.to_csv('KnoxEducationLevels.csv')

In [46]:
KnoxHousehold= KnoxHousehold.rename(columns={'Label (Grouping)':'Groups','Knox County, Tennessee!!Estimate':'Total'})
KnoxHousehold= KnoxHousehold[['Groups','Total']]
KnoxHouseholdAncestry = KnoxHousehold.loc[140:167].reset_index(drop=True)
KnoxHouseholdAncestry.to_csv('KnoxHouseholdAncestry.csv')